**FREE

// Déclaration des variables
Dcl-S message Char(50) Inz('Hello, RPGLE World!');

// Affichage d'un message simple
Dsply message;

// Fin du programme
*Inlr = *On;