**free

dcl-s number zoned(5);
dcl-s othernumber zoned (5);
dcl-s result zoned(5);

//Main
number =2;
othernumber = 5;
result = number +othernumber;

dsply result;

*inlr='1';
return;
