       IDENTIFICATION DIVISION. 
       PROGRAM-ID. PerformEx.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       BEGIN.
      *     PERFORM TestIF.
      *     PERFORM HelloWorld.
           STOP RUN.

       END PROGRAM PerformEx.

